In [ ]:
from sqlab.dbms.sqlite.nb_tools import show_tables, col, print_assert
from sqlab.dbms.sqlite.nb_tools import get_engine, add_connexion_listener
engine = get_engine()
extensions = [
    "~/.sqlpkg/nalgeon/crypto/crypto",
    "~/.sqlpkg/nalgeon/define/define",
    "~/.sqlpkg/nalgeon/regexp/regexp",
    "~/.sqlpkg/nyurik/compressions/libsqlite_compressions",
]
add_connexion_listener(engine, extensions)
%config SqlMagic.displaycon = False
%config SqlMagic.displaylimit = 0
%reload_ext sql
%sql engine
%sql --file output/dump.sql
show_tables(engine)

19 rows affected.

9 rows affected.

3 rows affected.

           Table                                                    Columns
0        decrypt                                                        msg
1     inhabitant  personid, name, villageid, gender, job, gold, state, hash
2           item                                          item, owner, hash
3     sqlab_info                                                name, value
4      sqlab_msg                                                        msg
5  sqlean_define                                           name, type, body
6        village                               villageid, name, chief, hash

# SQLab Island

## `SELECT *`

**Episode [042].**
Oh dear, what happened? It seems that I am the only survivor of the air crash. Wow, there are some villages on this island.

```sql
SELECT *
FROM village
```

**Statement.** Copy-paste the previous query. After the star `*`, add a comma and the given formula. Execute the complete query.

In [ ]:
%%sql
SELECT *
     , salt_042(sum(nn(hash)) OVER ()) AS token
FROM village
--> Episode [002]

villageid,name,chief,hash,token
1,Monkeycity,1,88658831093,279854843287661
2,Cucumbertown,6,440373806842,279854843287661
3,Onionville,13,696900492937,279854843287661

**Episode [002].** It seems there are a few people living in these villages.

**Statement.** How can you see a list of all inhabitants?

In [ ]:
%%sql
SELECT *
     , salt_002(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
--> Episode [048]

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,629712842257,134232424188549
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,134232424188549
3,Rita Ox,1,f,baker,350,friendly,550023509577,134232424188549
4,Carl Ox,1,m,merchant,250,friendly,828787612014,134232424188549
5,Dirty Dieter,3,m,smith,650,evil,891888801857,134232424188549
6,Gerry Slaughterer,2,m,butcher,4850,evil,723139316417,134232424188549
7,Peter Slaughterer,3,m,butcher,3250,evil,43765911445,134232424188549
8,Arthur Tailor,2,m,pilot,490,kidnapped,817131000772,134232424188549
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,134232424188549
10,Peter Drummer,1,m,smith,600,friendly,197435936456,134232424188549
11,Dirty Diane,3,f,farmer,10,evil,381700432515,134232424188549
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,134232424188549
13,Fred Dix,3,m,author,420,friendly,669762874033,134232424188549
14,Enrico Carpenter,3,m,weaponsmith,510,evil,307681368692,134232424188549
15,Helen Grasshead,2,f,dealer,680,friendly,257934290905,134232424188549
16,Ivy Hatter,1,f,dealer,770,evil,246604544829,134232424188549
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,134232424188549
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,134232424188549
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,134232424188549

## `WHERE`

### Comparison operator `=`

**Episode [048].**
Woah, so many people!

Man! I'm hungry. I will go and find a butcher to ask for some free sausages.

```sql
SELECT *
FROM inhabitant
WHERE job = 'butcher'
```

**Statement.** Copy-paste the previous query, add the given formula, and execute it.

In [ ]:
%%sql
SELECT *
     , salt_048(sum(nn(hash)) OVER ()) AS token
FROM inhabitant A
WHERE job = 'butcher'
--> Episode [023]

personid,name,villageid,gender,job,gold,state,hash,token
6,Gerry Slaughterer,2,m,butcher,4850,evil,723139316417,277365272722984
7,Peter Slaughterer,3,m,butcher,3250,evil,43765911445,277365272722984
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,277365272722984
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,277365272722984

**Episode [023].**

– There you are! Enjoy your meal! But take care of yourself. As long as you are unarmed, stay away from villains. Not everyone on this island is friendly.  
– Thank you, Edward!

**Statement.** Okay, let's see who is friendly on this island...

In [ ]:
%%sql
SELECT *
     , salt_023(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'
--> Episode [060]

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,629712842257,48742798564201
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,48742798564201
3,Rita Ox,1,f,baker,350,friendly,550023509577,48742798564201
4,Carl Ox,1,m,merchant,250,friendly,828787612014,48742798564201
10,Peter Drummer,1,m,smith,600,friendly,197435936456,48742798564201
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,48742798564201
13,Fred Dix,3,m,author,420,friendly,669762874033,48742798564201
15,Helen Grasshead,2,f,dealer,680,friendly,257934290905,48742798564201
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,48742798564201
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,48742798564201
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,48742798564201

In [ ]:
%%sql
-- Hint. Some inhabitants are neither friendly or evil.
SELECT *
     , salt_023(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state != 'evil'

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,629712842257,49008030805805
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,49008030805805
3,Rita Ox,1,f,baker,350,friendly,550023509577,49008030805805
4,Carl Ox,1,m,merchant,250,friendly,828787612014,49008030805805
8,Arthur Tailor,2,m,pilot,490,kidnapped,817131000772,49008030805805
10,Peter Drummer,1,m,smith,600,friendly,197435936456,49008030805805
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,49008030805805
13,Fred Dix,3,m,author,420,friendly,669762874033,49008030805805
15,Helen Grasshead,2,f,dealer,680,friendly,257934290905,49008030805805
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,49008030805805
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,49008030805805
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,49008030805805

In [ ]:
%%sql
-- Hint. Filter out the evil inhabitants, not the friendly ones.
SELECT *
     , salt_023(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'evil'

personid,name,villageid,gender,job,gold,state,hash,token
5,Dirty Dieter,3,m,smith,650,evil,891888801857,47228972247943
6,Gerry Slaughterer,2,m,butcher,4850,evil,723139316417,47228972247943
7,Peter Slaughterer,3,m,butcher,3250,evil,43765911445,47228972247943
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,47228972247943
11,Dirty Diane,3,f,farmer,10,evil,381700432515,47228972247943
14,Enrico Carpenter,3,m,weaponsmith,510,evil,307681368692,47228972247943
16,Ivy Hatter,1,f,dealer,770,evil,246604544829,47228972247943

In [ ]:
%%sql
-- Hint. Filter out the evil inhabitants.
SELECT *
     , salt_023(sum(nn(hash)) OVER ()) AS token
FROM inhabitant

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,629712842257,51880209807809
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,51880209807809
3,Rita Ox,1,f,baker,350,friendly,550023509577,51880209807809
4,Carl Ox,1,m,merchant,250,friendly,828787612014,51880209807809
5,Dirty Dieter,3,m,smith,650,evil,891888801857,51880209807809
6,Gerry Slaughterer,2,m,butcher,4850,evil,723139316417,51880209807809
7,Peter Slaughterer,3,m,butcher,3250,evil,43765911445,51880209807809
8,Arthur Tailor,2,m,pilot,490,kidnapped,817131000772,51880209807809
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,51880209807809
10,Peter Drummer,1,m,smith,600,friendly,197435936456,51880209807809
11,Dirty Diane,3,f,farmer,10,evil,381700432515,51880209807809
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,51880209807809
13,Fred Dix,3,m,author,420,friendly,669762874033,51880209807809
14,Enrico Carpenter,3,m,weaponsmith,510,evil,307681368692,51880209807809
15,Helen Grasshead,2,f,dealer,680,friendly,257934290905,51880209807809
16,Ivy Hatter,1,f,dealer,770,evil,246604544829,51880209807809
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,51880209807809
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,51880209807809
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,51880209807809

### Boolean operator `AND`

**Episode [060].**
There is no way around getting a sword for myself.

**Statement.** Now try to find a friendly weaponsmith to forge you one.

_Tip._ You can combine predicates in the `WHERE` clause with `AND`.

In [ ]:
%%sql
SELECT *
     , salt_060(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'
    AND job = 'weaponsmith'
--> Episode [069]

personid,name,villageid,gender,job,gold,state,hash,token
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,111512971675362

### Comparison operator `LIKE`

**Episode [069].**
Hm, that's very few.

**Statement.** Maybe other friendly smiths can help you out, e.g. a blacksmith.

_Tip._ Try out: job LIKE '%smith' to find all inhabitants whose job ends with 'smith' (% is a wildcard for any number of characters).

In [ ]:
%%sql
SELECT *
     , salt_069(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'
    AND job LIKE '%smith'
--> Episode [090]

personid,name,villageid,gender,job,gold,state,hash,token
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,71982920310535
10,Peter Drummer,1,m,smith,600,friendly,197435936456,71982920310535
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,71982920310535

In [ ]:
%%sql
-- Hint. Keep all villagers whose job's name ends with 'smith' (e.g., 'smith', 'blacksmith', etc.).
SELECT *
     , salt_069(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'
    AND job LIKE 'smith'

personid,name,villageid,gender,job,gold,state,hash,token
10,Peter Drummer,1,m,smith,600,friendly,197435936456,70704759633788

In [ ]:
%%sql
-- Hint. Filter out the villagers whose job's name doesn't ends with 'smith'.
SELECT *
     , salt_069(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,629712842257,75245509379022
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,75245509379022
3,Rita Ox,1,f,baker,350,friendly,550023509577,75245509379022
4,Carl Ox,1,m,merchant,250,friendly,828787612014,75245509379022
10,Peter Drummer,1,m,smith,600,friendly,197435936456,75245509379022
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,75245509379022
13,Fred Dix,3,m,author,420,friendly,669762874033,75245509379022
15,Helen Grasshead,2,f,dealer,680,friendly,257934290905,75245509379022
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,75245509379022
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,75245509379022
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,75245509379022

In [ ]:
%%sql
-- Hint. Filter out the villagers which are not friendly.
SELECT *
     , salt_069(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE job LIKE '%smith'

personid,name,villageid,gender,job,gold,state,hash,token
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,72879560548572
5,Dirty Dieter,3,m,smith,650,evil,891888801857,72879560548572
10,Peter Drummer,1,m,smith,600,friendly,197435936456,72879560548572
14,Enrico Carpenter,3,m,weaponsmith,510,evil,307681368692,72879560548572
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,72879560548572

## `INSERT`

**Episode [090].**
That looks better! I will go and visit those smiths.

– Hi stranger! Where are you going? I'm Paul, I'm the major of Monkeycity. I will go ahead and register you as a citizen.

```sql
INSERT INTO inhabitant (name, villageid, gender, job, gold, state) VALUES ('Stranger', 1, '?', '?', 0, '?')
```

– No need to call me stranger!

**Statement.** First, execute the `INSERT` query. Then, look for your personid.

_Tip._ In former queries, the * stands for: all columns. Instead of the star, you can also address one or more columns (separated by a comma) and you will only get the columns you need.

In [ ]:
%%sql
INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?');


SELECT personid
     , salt_090(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE name = 'Stranger';
--> Episode [099]

1 rows affected.

personid,token
20,30369443645964

In [ ]:
%%sql
-- Hint. Oops, it seems you have executed the `INSERT` query twice or more.
-- Execute the following queries to cancel all these insertions:
-- DELETE from inhabitant WHERE name = 'Stranger';
-- RESET inhabitant;
INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?');

SELECT personid
     , salt_090(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE name = 'Stranger';

1 rows affected.

personid,token
20,30707931916007
21,30707931916007

In [ ]:
%%sql
-- Hint. Oops, it seems you have executed the `INSERT` query twice or more.
-- Execute the following queries to cancel all these insertions:
-- DELETE from inhabitant WHERE name = 'Stranger';
-- RESET inhabitant;
INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?');

SELECT personid
     , salt_090(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE name = 'Stranger';

1 rows affected.

personid,token
20,29281304584518
21,29281304584518
22,29281304584518

In [ ]:
%%sql
-- Hint. Oops, it seems you have executed the `INSERT` query twice or more.
-- Execute the following queries to cancel all these insertions:
-- DELETE from inhabitant WHERE name = 'Stranger';
-- RESET inhabitant;
INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?');

SELECT personid
     , salt_090(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE name = 'Stranger';

1 rows affected.

personid,token
20,29480629176331
21,29480629176331
22,29480629176331
23,29480629176331

In [ ]:
%%sql
-- Hint. Oops, it seems you have executed the `INSERT` query twice or more.
-- Execute the following queries to cancel all these insertions:
-- DELETE from inhabitant WHERE name = 'Stranger';
-- RESET inhabitant;
INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?');

SELECT personid
     , salt_090(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE name = 'Stranger';

1 rows affected.

personid,token
20,29420272476840
21,29420272476840
22,29420272476840
23,29420272476840
24,29420272476840

In [ ]:
%%sql
-- Action. Fix mutiple insertions of the same record.
DELETE FROM inhabitant WHERE name = 'Stranger';
REINDEX inhabitant;


INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?');

5 rows affected.

1 rows affected.

++
||
++
++

## `WHERE` (again)

### Comparison operator `=`

**Episode [099].**

– Hi Ernest! How much is a sword?  
– I can offer to make you a sword for 150 gold. That's the cheapest you will find!

**Statement.** How much gold do you have?

In [ ]:
%%sql
SELECT gold
     , salt_099(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE personid = 20
--> Episode [073]

gold,token
0,8437518293606

In [ ]:
%%sql
-- Hint. Restrict the result to the Stranger's row (personid: 20).
SELECT personid, gold
     , salt_099(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
--> Episode [073]

personid,gold,token
1,850,100208571032
2,280,100208571032
3,350,100208571032
4,250,100208571032
5,650,100208571032
6,4850,100208571032
7,3250,100208571032
8,490,100208571032
9,550,100208571032
10,600,100208571032
11,10,100208571032
12,680,100208571032
13,420,100208571032
14,510,100208571032
15,680,100208571032
16,770,100208571032
17,990,100208571032
18,390,100208571032
19,2280,100208571032
20,0,100208571032

### `IS NULL`

**Episode [073].**
Damn! No mon, no fun. There has to be another option to earn gold other than going to work. Maybe I could collect ownerless items and sell them!

**Statement.** Make a list of all items that don't belong to anyone.

_Tip._ You can recognize ownerless items by: WHERE owner IS NULL

In [ ]:
%%sql
SELECT *
     , salt_073(sum(nn(hash)) OVER ()) AS token
FROM item
WHERE owner IS NULL
--> Episode [093]

item,owner,hash,token
bucket,None,886234623795,250855062766413
carton,None,716044046042,250855062766413
coffee cup,None,812063378701,250855062766413
lightbulb,None,247369210975,250855062766413
ring,None,255084667299,250855062766413
teapot,None,447146496477,250855062766413

## `UPDATE`

### `UPDATE` one row

**Episode [093].** So much cool stuff!

Yay, a coffee cup. Let's collect it!

```sql
UPDATE item
SET owner = 20
WHERE item = 'coffee cup'
```

**Statement.** Execute the `UPDATE` query, and check the `item` table afterwards.

In [ ]:
%%sql
UPDATE item
SET owner = 20
WHERE item = 'coffee cup';


SELECT *
     , salt_093(sum(nn(hash)) OVER ()) AS token
FROM item
--> Episode [033]

1 rows affected.

item,owner,hash,token
bucket,None,886234623795,112212343494901
carton,None,716044046042,112212343494901
coffee cup,20,316658990502,112212343494901
lightbulb,None,247369210975,112212343494901
ring,None,255084667299,112212343494901
teapot,None,447146496477,112212343494901
hammer,2,879221634715,112212343494901
cane,5,101850668304,112212343494901
rope,17,644124527284,112212343494901

### `UPDATE` several rows

**Episode [033].**

**Statement.** Do you know a trick how to collect all the ownerless items? Afterwards, list all of the items you own.

In [ ]:
%%sql
UPDATE item
SET owner = 20
WHERE owner IS NULL;


SELECT item
     , salt_033(sum(nn(hash)) OVER ()) AS token
FROM item
WHERE owner = 20
--> Episode [024]

5 rows affected.

item,token
bucket,140361992167979
carton,140361992167979
coffee cup,140361992167979
lightbulb,140361992167979
ring,140361992167979
teapot,140361992167979

In [ ]:
%%sql
-- Hint. It seems you have failed to collect any other ownerless item. Remember: comparing to `NULL` with the `=`
-- operator always returns... `NULL`. You need the special operator `IS` instead.
SELECT item
     , salt_033(sum(nn(hash)) OVER ()) AS token
FROM item
WHERE item = 'coffee cup'

item,token
coffee cup,137567818264690

In [ ]:
%%sql
-- Hint. Restrict the result to the Stranger's rows (personid: 20).
SELECT item
     , salt_033(sum(nn(hash)) OVER ()) AS token
FROM item

item,token
bucket,133239413310346
carton,133239413310346
coffee cup,133239413310346
lightbulb,133239413310346
ring,133239413310346
teapot,133239413310346
hammer,133239413310346
cane,133239413310346
rope,133239413310346

In [ ]:
%%sql
UPDATE item
SET owner = 20;


SELECT item
     , salt_033(sum(nn(hash)) OVER ()) AS token
FROM item
--> Episode [025]

9 rows affected.

item,token
bucket,134094834306231
carton,134094834306231
coffee cup,134094834306231
lightbulb,134094834306231
ring,134094834306231
teapot,134094834306231
hammer,134094834306231
cane,134094834306231
rope,134094834306231

**Episode [025].** So greedy! You've snapped up all items, even those that already had an owner.

**Statement.** Let's give them back to their rightful owners: the cane to 5, the hammer to 2 and the rope to 17. Afterwards, list all of the items you own.

In [ ]:
%%sql
UPDATE item
SET owner = 5
WHERE item = 'cane';

UPDATE item
SET owner = 2
WHERE item = 'hammer';

UPDATE item
SET owner = 17
WHERE item = 'rope';

SELECT item
     , salt_025(sum(nn(hash)) OVER ()) AS token
FROM item
WHERE owner = 20
--> Episode [024]

1 rows affected.

1 rows affected.

1 rows affected.

item,token
bucket,206536196373822
carton,206536196373822
coffee cup,206536196373822
lightbulb,206536196373822
ring,206536196373822
teapot,206536196373822

## Complex condition

**Episode [024].**

**Statement.** Find a friendly inhabitant who is either a merchant or a dealer. Maybe they want to buy some of your items.

In [ ]:
%%sql
-- With a logical `OR`.
SELECT *
     , salt_024(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'
    AND (job = 'merchant' OR job = 'dealer')
--> Episode [034]

personid,name,villageid,gender,job,gold,state,hash,token
4,Carl Ox,1,m,merchant,250,friendly,828787612014,166118557530211
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,166118557530211
15,Helen Grasshead,2,f,dealer,680,friendly,257934290905,166118557530211

In [ ]:
%%sql
-- With the `IN` operator (recommended). A cleaner, more scalable way to check a column against multiple values.
SELECT *
     , salt_024(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'
    AND job in ('merchant', 'dealer')

personid,name,villageid,gender,job,gold,state,hash,token
4,Carl Ox,1,m,merchant,250,friendly,828787612014,166118557530211
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,166118557530211
15,Helen Grasshead,2,f,dealer,680,friendly,257934290905,166118557530211

In [ ]:
%%sql
-- Hint. Your result include one evil villager. Use both `AND` and `OR`, and don't forget to put the brackets
-- correctly.
SELECT *
     , salt_024(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly' AND job = 'merchant'
    OR job = 'dealer'

personid,name,villageid,gender,job,gold,state,hash,token
4,Carl Ox,1,m,merchant,250,friendly,828787612014,166386341405502
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,166386341405502
15,Helen Grasshead,2,f,dealer,680,friendly,257934290905,166386341405502
16,Ivy Hatter,1,f,dealer,770,evil,246604544829,166386341405502

In [ ]:
%%sql
-- Hint. You have found inhabitants who are either friendly, or dealers, or merchants, but "friendly" is not an
-- option.
SELECT *
     , salt_024(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'
    OR job = 'dealer'
    OR job = 'merchant'

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,629712842257,160930575842630
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,160930575842630
3,Rita Ox,1,f,baker,350,friendly,550023509577,160930575842630
4,Carl Ox,1,m,merchant,250,friendly,828787612014,160930575842630
10,Peter Drummer,1,m,smith,600,friendly,197435936456,160930575842630
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,160930575842630
13,Fred Dix,3,m,author,420,friendly,669762874033,160930575842630
15,Helen Grasshead,2,f,dealer,680,friendly,257934290905,160930575842630
16,Ivy Hatter,1,f,dealer,770,evil,246604544829,160930575842630
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,160930575842630
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,160930575842630
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,160930575842630

In [ ]:
%%sql
-- Hint. Include the friendly merchants too.
SELECT *
     , salt_024(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly' AND job = 'dealer'

personid,name,villageid,gender,job,gold,state,hash,token
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,165298064089045
15,Helen Grasshead,2,f,dealer,680,friendly,257934290905,165298064089045

In [ ]:
%%sql
-- Hint. Include the friendly dealers too.
SELECT *
     , salt_024(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly' AND job = 'merchant'

personid,name,villageid,gender,job,gold,state,hash,token
4,Carl Ox,1,m,merchant,250,friendly,828787612014,165869401788831

## `UPDATE` two rows

**Episode [034].**

– I'd like to get the ring and the teapot. The rest is nothing but scrap. Please give me the two items. My `personid` is 15.

**Statement.** Afterwards, check the items that she owns.

In [ ]:
%%sql
UPDATE item
SET owner = 15
WHERE item IN ('ring', 'teapot');


SELECT *
     , salt_034(sum(nn(hash)) OVER ()) AS token
FROM item
WHERE owner = 15
--> Episode [091]

2 rows affected.

item,owner,hash,token
ring,15,285279987781,261352685198133
teapot,15,950599138709,261352685198133

## Transfer some gold

**Episode [091].**

— Thank you! Here, some gold!

**Statement.** Transfer 120 from Helen's gold to yours, and then check the new amounts of your two rows.

_Tip._ SQL has no “transfer” operation. Use two `UPDATE` statements.

In [ ]:
%%sql
UPDATE inhabitant
SET gold = gold - 120
WHERE personid = 15;


UPDATE inhabitant
SET gold = gold + 120
WHERE personid = 20;


SELECT name
     , gold
     , salt_091(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE personid IN (15, 20)
--> Episode [080]

1 rows affected.

1 rows affected.

name,gold,token
Helen Grasshead,560,35110542179316
Stranger,120,35110542179316

In [ ]:
%%sql
-- Hint. Restrict the result to the row of Helen (15) and yours (20).
SELECT name
     , gold
     , salt_091(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
LIMIT 1

name,gold,token
Paul Bakerman,850,25468836221693

In [ ]:
%%sql
-- Action. Restore the gold.
UPDATE inhabitant SET gold = 680 WHERE personid = 15;
UPDATE inhabitant SET gold = 0   WHERE personid = 20

1 rows affected.

1 rows affected.

++
||
++
++

In [ ]:
%%sql
UPDATE inhabitant
SET gold = gold - 120
WHERE personid = 15;


SELECT name
     , gold
     , salt_091(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE personid IN (15, 20)
--> Episode [075]

1 rows affected.

name,gold,token
Helen Grasshead,560,34877944868442
Stranger,0,34877944868442

In [ ]:
%%sql
-- Hint. Restrict the result to the row of Helen (15) and yours (20).
SELECT name
     , gold
     , salt_091(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
limit 1

name,gold,token
Paul Bakerman,850,27366575987011

In [ ]:
%%sql
-- Action. Restore the gold.
UPDATE inhabitant SET gold = 680 WHERE personid = 15;
UPDATE inhabitant SET gold = 0   WHERE personid = 20

1 rows affected.

1 rows affected.

++
||
++
++

In [ ]:
%%sql
UPDATE inhabitant
SET gold = gold + 120
WHERE personid = 20;


SELECT name
     , gold
     , salt_091(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE personid IN (15, 20)
--> Episode [076]

1 rows affected.

name,gold,token
Helen Grasshead,680,34756549418683
Stranger,120,34756549418683

In [ ]:
%%sql
-- Hint. Restrict the result to the row of Helen (15) and yours (20).
SELECT name
     , gold
     , salt_091(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
limit 1

name,gold,token
Paul Bakerman,850,27245187074464

**Episode [075].**

**Statement.** You have correctly updated Helen's gold. Now update yours.

In [ ]:
%%sql
UPDATE inhabitant
SET gold = gold + 120
WHERE personid = 20;


SELECT name
     , gold
     , salt_075(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE personid IN (15, 20)
--> Episode [080]

1 rows affected.

name,gold,token
Helen Grasshead,680,36005631554399
Stranger,240,36005631554399

**Episode [076].**

**Statement.** You have correctly updated your gold. Now update Helen's.

In [ ]:
%%sql
UPDATE inhabitant
SET gold = gold - 120
WHERE personid = 15;


SELECT name
     , gold
     , salt_076(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE personid IN (15, 20)
--> Episode [080]

1 rows affected.

name,gold,token
Helen Grasshead,560,11047667535310
Stranger,240,11047667535310

## `UPDATE` the name of the stranger

**Episode [080].** Unfortunately, that's not enough gold to buy a sword. Seems like I do have to work after all. Maybe it's not a bad idea to change my name from Stranger to my real name before I will apply for a job.

**Statement.** Update your name to 'Leslie Qualls' and show the updated row.

In [ ]:
%%sql
UPDATE inhabitant
SET name = 'Leslie Qualls'
WHERE personid = 20;


SELECT *
     , salt_080(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE personid = 20
--> Episode [078]

1 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
20,Leslie Qualls,1,?,?,240,?,389732266343,17932999715393

In [ ]:
%%sql
-- Hint. Restrict the result to your row (20).
SELECT *
     , salt_080(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
limit 1

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,629712842257,26601435332568

In [ ]:
%%sql
-- Hint. The name Qualls contains two 'l's.
UPDATE inhabitant
SET name = 'Leslie Quals'
WHERE personid = 20;


SELECT *
     , salt_080(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE personid = 20

1 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
20,Leslie Quals,1,?,?,240,?,409621283884,17913110945546

## `ORDER BY`

**Episode [078].**

**Statement.** Since baking is one of your hobbies, why not find a baker who you can work for?

_Tip._ List all bakers and use `ORDER BY` gold to sort the results. `ORDER BY` gold `DESC` is even better because then the richest baker is on top.

In [ ]:
x = 350 # gold on the last row

In [ ]:
%%sql
SELECT *
     , salt_078({{x}} + sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE job = 'baker'
ORDER BY gold DESC
--> Episode [010]

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,629712842257,34387157037879
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,34387157037879
3,Rita Ox,1,f,baker,350,friendly,550023509577,34387157037879

In [ ]:
assert x == col("gold")[-1]

In [ ]:
x = 550

In [ ]:
%%sql
-- Hint. Don't forget to sort the result by decreasing gold.
SELECT *
     , salt_078({{x}} + sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE job = 'baker'

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,629712842257,34387157037311
3,Rita Ox,1,f,baker,350,friendly,550023509577,34387157037311
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,34387157037311

In [ ]:
assert x == col("gold")[-1]

In [ ]:
x = 850

In [ ]:
%%sql
-- Hint. The gold must be sorted by decreasing order.
SELECT *
     , salt_078({{x}} + sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE job = 'baker'
ORDER BY gold

personid,name,villageid,gender,job,gold,state,hash,token
3,Rita Ox,1,f,baker,350,friendly,550023509577,34387157037507
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,34387157037507
1,Paul Bakerman,1,m,baker,850,friendly,629712842257,34387157037507

In [ ]:
assert x == col("gold")[-1]

In [ ]:
%%sql
-- Hint. Don't forget to update the token formula.
SELECT *
     , salt_078(0 + sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE job = 'baker'

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,629712842257,34387157037717
3,Rita Ox,1,f,baker,350,friendly,550023509577,34387157037717
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,34387157037717

**Episode [010].** Aha, Paul! I know him!

– Hi, you again! I saw you want to work as a baker? Okay! You will be paid 1 gold for 100 bread rolls.

(8 hours later...)

– Here, I made ten thousand bread rolls! I quit! This should be enough money to buy a sword. Let's see what happens with my gold balance.

Here's your new sword, Losloo Qoolls! Now you can go everywhere.

**Statement.** Transfer your salary (100) from Paul's gold to yours, and substract the price of the sword (150). Then, display your gold balance.

In [ ]:
%%sql
UPDATE inhabitant
SET gold = gold - 100
WHERE personid = 1;


UPDATE inhabitant
SET gold = gold + 100 - 150
WHERE personid = 20;


SELECT gold
     , salt_010(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE personid = 20
--> Episode [086]

1 rows affected.

1 rows affected.

gold,token
190,156519988531042

**Episode [086].**

– My name is Leslie qualls! Thanks anyway!

**Statement.** Is there a pilot on this island by any chance? He could fly you home.

In [ ]:
%%sql
SELECT *
     , salt_086(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE job = 'pilot'
--> Episode [029]

personid,name,villageid,gender,job,gold,state,hash,token
8,Arthur Tailor,2,m,pilot,490,kidnapped,817131000772,229611341712473

## Joins

**Episode [029].** Oh no, his state is 'kidnapped'.

Horrible, the pilot is held captive by Dirty Dieter! I will show you a trick how to find out the name of the village where Dirty Dieter lives.

```sql
SELECT A.name
FROM village A
JOIN inhabitant B ON A.villageid = B.villageid
WHERE B.name = 'Dirty Dieter'
```

**Statement.** Copy-paste the previous query, add the given formula, and execute it.

**Annotation.** The expression presented here is called a join. It combines the information of the `inhabitant`
table with information of the `village` table by matching `villageid` values.

In [ ]:
%%sql
SELECT A.name
     , salt_029(sum(nn(A.hash) + nn(B.hash)) OVER ()) AS token
FROM village A
JOIN inhabitant B ON A.villageid = B.villageid
WHERE B.name = 'Dirty Dieter'
--> Episode [045]

name,token
Onionville,256549873381875

In [ ]:
%%sql
-- Implicit `JOIN`. You may encounter a syntax where the join conditions are mixed with the filter conditions.
-- This can make the query harder to understand, especially as the number of tables and conditions increases.
-- While this method is still supported for backward compatibility, it is generally considered outdated. The
-- explicit JOIN syntax is recommended for new SQL code.
SELECT A.name
     , salt_029(sum(nn(A.hash) + nn(B.hash)) OVER ()) AS token
FROM village A, inhabitant B
WHERE A.villageid = B.villageid
  AND B.name = 'Dirty Dieter'

name,token
Onionville,256549873381875

**Episode [045].**

– Thanks for the hint!

**Statement.** Use the join to find out the chief's name of the village Onionville.

_Tip._ In the column `chief` in the village table, the `personid` of the chief is stored.

In [ ]:
%%sql
SELECT B.name
     , salt_045(sum(nn(A.hash) + nn(B.hash)) OVER ()) AS token
FROM village A
JOIN inhabitant B ON A.chief = B.personid
WHERE A.name = 'Onionville'
--> Episode [012]

name,token
Fred Dix,240130125947971

In [ ]:
assert col("name") == ["Fred Dix"]

In [ ]:
%%sql
-- Hint. We are only interested in the chief of Onionville.
SELECT B.name
     , salt_045(sum(nn(A.hash) + nn(B.hash)) OVER ()) AS token
FROM village A
JOIN inhabitant B ON A.chief = B.personid

name,token
Paul Bakerman,239201739003301
Gerry Slaughterer,239201739003301
Fred Dix,239201739003301

In [ ]:
%%sql
-- Hint. Don't forget the join condition (`ON ...`). Without it, you make a cartesian product.
SELECT B.name
     , salt_045(sum(nn(A.hash) + nn(B.hash)) OVER ()) AS token
FROM village A, inhabitant B
WHERE A.name = 'Onionville'

name,token
Paul Bakerman,228517756804227
Ernest Perry,228517756804227
Rita Ox,228517756804227
Carl Ox,228517756804227
Dirty Dieter,228517756804227
Gerry Slaughterer,228517756804227
Peter Slaughterer,228517756804227
Arthur Tailor,228517756804227
Tiffany Drummer,228517756804227
Peter Drummer,228517756804227
Dirty Diane,228517756804227
Otto Alexander,228517756804227
Fred Dix,228517756804227
Enrico Carpenter,228517756804227
Helen Grasshead,228517756804227
Ivy Hatter,228517756804227
Edward Grasshead,228517756804227
Ryan Horse,228517756804227
Ann Meaty,228517756804227
Leslie Quals,228517756804227

## `COUNT(*)`

**Episode [012].** I've got it! I will visit Fred and ask him about Dirty Dieter and the pilot.

Um, how many inhabitants does Onionville have?

```sql
SELECT COUNT(*) as population
FROM inhabitant A
JOIN village B ON A.villageid = B.villageid
WHERE B.name = 'Onionville'
```

**Statement.** Copy-paste the previous query, add the given formula, and execute it.

In [ ]:
%%sql
SELECT count(*) AS population
     , salt_012(sum(avg(nn(A.hash) + nn(B.hash))) OVER ()) AS token
FROM inhabitant A
JOIN village B ON A.villageid = B.villageid
WHERE B.name = 'Onionville'
--> Episode [032]

population,token
8,239033309293379

**Episode [032].**

– Hello Leslie Qualls, the pilot is held captive by Dirty Dieter in his sister's house.

**Statement.** Shall I tell you how many women there are in Onionville? Nah, you can figure it out by yourself!

_Tip._ Women show up as gender = 'f'.

In [ ]:
x = 1 # this number

In [ ]:
%%sql
SELECT count(*) AS women
     , salt_032({{x}} + sum(avg(nn(A.hash) + nn(B.hash))) OVER ()) AS token
FROM inhabitant A
JOIN village B ON A.villageid = B.villageid
    AND B.name = 'Onionville'
    AND gender = 'f'
--> Episode [036]

women,token
1,40087148930214

In [ ]:
assert x == col("women")[0]

In [ ]:
x = 8

In [ ]:
%%sql
-- Hint. This is the population of Onionville. We are only interested in its women.
SELECT count(*) AS women
     , salt_032({{x}} + sum(avg(nn(A.hash) + nn(B.hash))) OVER ()) AS token
FROM inhabitant A, village B
WHERE A.villageid = B.villageid
    AND B.name = 'Onionville'

women,token
8,41267390156266

In [ ]:
assert x == col("women")[0]

In [ ]:
x = 6

In [ ]:
%%sql
-- Hint. This is the total number of women. We are only interested in those of Onionville.
SELECT count(*) AS women
     , salt_032({{x}} + sum(avg(nn(A.hash) + nn(B.hash))) OVER ()) AS token
FROM inhabitant A, village B
WHERE A.villageid = B.villageid
    AND gender = 'f'

women,token
6,39668153149439

In [ ]:
assert x == col("women")[0]

In [ ]:
x = 6

In [ ]:
%%sql
-- Hint. Don't forget the join condition (`ON ...`).
SELECT count(*) AS women
     , salt_032({{x}} + sum(avg(nn(A.hash) + nn(B.hash))) OVER ()) AS token
FROM inhabitant A, village B
WHERE gender = 'f'
    AND B.name = 'Onionville'

women,token
6,40092150478088

In [ ]:
assert x == col("women")[0]

**Episode [036].** Oh, only one woman.

**Statement.** What's her name?

In [ ]:
%%sql
SELECT A.name
     , salt_036(sum(nn(A.hash) + nn(B.hash)) OVER ()) AS token
FROM inhabitant A
JOIN village B ON A.villageid = B.villageid
WHERE B.name = 'Onionville'
    AND gender = 'f'
--> Episode [035]

name,token
Dirty Diane,123740947235637

In [ ]:
assert col("name") == ['Dirty Diane']

In [ ]:
%%sql
-- Hint. Restrict the result to Onionville.
SELECT A.name
     , salt_036(sum(nn(A.hash) + nn(B.hash)) OVER ()) AS token
FROM inhabitant A
JOIN village B ON A.villageid = B.villageid
WHERE gender = 'f'

name,token
Rita Ox,127399335350240
Tiffany Drummer,127399335350240
Dirty Diane,127399335350240
Helen Grasshead,127399335350240
Ivy Hatter,127399335350240
Ann Meaty,127399335350240

In [ ]:
%%sql
-- Hint. Restrict the result to the women.
SELECT A.name
     , salt_036(sum(nn(A.hash) + nn(B.hash)) OVER ()) AS token
FROM inhabitant A
JOIN village B ON A.villageid = B.villageid
WHERE B.name = 'Onionville'

name,token
Ernest Perry,132242591777783
Dirty Dieter,132242591777783
Peter Slaughterer,132242591777783
Dirty Diane,132242591777783
Fred Dix,132242591777783
Enrico Carpenter,132242591777783
Edward Grasshead,132242591777783
Ryan Horse,132242591777783

## `SUM()`

**Episode [035].** Let's go!

– Leslie Qualls, if you hand me over the entire property of our nearby village Cucumbertown, I will release the pilot. I will show you now what this property consists of.

```sql
SELECT SUM(A.gold) as total
FROM inhabitant A
JOIN village B ON A.villageid = B.villageid
WHERE B.name = 'Cucumbertown'
```

**Statement.** Copy-paste the previous query, add the given formula, and execute it.

In [ ]:
%%sql
SELECT sum(A.gold) AS total
     , salt_035(sum(avg(nn(A.hash) + nn(B.hash))) OVER ()) AS token
FROM inhabitant A
JOIN village B ON A.villageid = B.villageid
WHERE B.name = 'Cucumbertown'
--> Episode [046]

total,token
8860,152726963163365

**Episode [046].** Oh no, baking bread alone can't solve my problems. If I continue working and selling items though, I could earn more gold than the worth of gold inventories of all bakers, dealers and merchants together.

**Statement.** Sum the gold of all these people.

In [ ]:
x = 3910 # this sum

In [ ]:
%%sql
SELECT sum(inhabitant.gold) AS total
     , salt_046({{x}} + sum(avg(nn(hash))) OVER ()) AS token
FROM inhabitant
WHERE job IN ('baker', 'dealer', 'merchant')
--> Episode [071]

total,token
3910,203677077709662

In [ ]:
assert x == col("total")[0]

In [ ]:
x = 18820

In [ ]:
%%sql
-- Hint. Restrict your queries to the bakers, dealers and merchants together.
SELECT sum(inhabitant.gold) AS total
     , salt_046({{x}} + sum(avg(nn(hash))) OVER ()) AS token
FROM inhabitant

total,token
18820,203631832624186

In [ ]:
assert x == col("total")[0]

## `AVG()`

**Episode [071].** That's not enough.

Let's have a look at how much average gold people own, depending on their job.

```sql
SELECT job, avg(gold)
FROM inhabitant
GROUP BY job
ORDER BY avg(gold)
```

**Statement.** Copy-paste the previous query, add the given formula, and execute it.

In [ ]:
%%sql
SELECT job
     , avg(gold) AS average
     , salt_071(sum(avg(nn(hash))) OVER ()) AS token
FROM inhabitant
GROUP BY job
ORDER BY average
--> Episode [018]

job,average,token
farmer,10.0,220503802201059
?,190.0,220503802201059
merchant,250.0,220503802201059
blacksmith,390.0,220503802201059
weaponsmith,395.0,220503802201059
author,420.0,220503802201059
pilot,490.0,220503802201059
baker,550.0,220503802201059
smith,625.0,220503802201059
dealer,670.0,220503802201059
butcher,2842.5,220503802201059

## `DELETE`

**Episode [018].** Ok, so the only way is to mug the villains. Or I might as well go ahead and just kill Dirty Dieter with my sword!

```sql
DELETE
FROM inhabitant
WHERE name = 'Dirty Dieter'
```

**Statement.** Execute the previous query. Which item is now ownerless?

In [ ]:
%%sql
DELETE
FROM inhabitant
WHERE name = 'Dirty Dieter';


SELECT item
     , salt_018(sum(nn(hash)) OVER ()) AS token
FROM item
WHERE owner IS NULL
--> Episode [004]

1 rows affected.

item,token
cane,193773092890240

In [ ]:
assert col("item") == ['cane']

**Episode [004].** Dirty Diane: Heeeey! Now I'm very angry!

What will you do next, Leslie Qualls?

**Statement.** Delete Dirty Diane, and show the remaining inhabitants of Onionville (villageid 3).

In [ ]:
%%sql
DELETE
FROM inhabitant
WHERE name = 'Dirty Diane';


SELECT *
     , salt_004(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
WHERE villageid = 3
--> Episode [051]

1 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,58856868131435
7,Peter Slaughterer,3,m,butcher,3250,evil,43765911445,58856868131435
13,Fred Dix,3,m,author,420,friendly,669762874033,58856868131435
14,Enrico Carpenter,3,m,weaponsmith,510,evil,307681368692,58856868131435
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,58856868131435
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,58856868131435

In [ ]:
assert "Dirty Diane" not in col("name")

In [ ]:
%%sql
-- Hint. Restrict the result to the village of Onionville.
SELECT *
     , salt_004(sum(nn(hash)) OVER ()) AS token
FROM inhabitant
--> Episode [051]

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,750,friendly,503254218482,55810895967275
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,55810895967275
3,Rita Ox,1,f,baker,350,friendly,550023509577,55810895967275
4,Carl Ox,1,m,merchant,250,friendly,828787612014,55810895967275
6,Gerry Slaughterer,2,m,butcher,4850,evil,723139316417,55810895967275
7,Peter Slaughterer,3,m,butcher,3250,evil,43765911445,55810895967275
8,Arthur Tailor,2,m,pilot,490,kidnapped,817131000772,55810895967275
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,55810895967275
10,Peter Drummer,1,m,smith,600,friendly,197435936456,55810895967275
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,55810895967275
13,Fred Dix,3,m,author,420,friendly,669762874033,55810895967275
14,Enrico Carpenter,3,m,weaponsmith,510,evil,307681368692,55810895967275
15,Helen Grasshead,2,f,dealer,560,friendly,611654306462,55810895967275
16,Ivy Hatter,1,f,dealer,770,evil,246604544829,55810895967275
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,55810895967275
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,55810895967275
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,55810895967275
20,Leslie Quals,1,?,?,190,?,228447687374,55810895967275

## Epilog

**Episode [051].**

– Yeah! Now I release the pilot!<br>
– Thank's for releasing me, Leslie Qualls! I will fly you home!<br>
– I take my sword, some gold and lots of useless items with me as a souvenir.

**Statement.** Change the pilot's status to 'friendly', your own status to 'emigrated', and show the table `inhabitant`.

In [ ]:
%%sql
UPDATE inhabitant
SET state = 'friendly'
WHERE job = 'pilot';

SELECT *
     , salt_051(sum(nn(hash)) OVER ()) AS token
FROM inhabitant;
--> Episode [052]

1 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,750,friendly,503254218482,214972673887395
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,214972673887395
3,Rita Ox,1,f,baker,350,friendly,550023509577,214972673887395
4,Carl Ox,1,m,merchant,250,friendly,828787612014,214972673887395
6,Gerry Slaughterer,2,m,butcher,4850,evil,723139316417,214972673887395
7,Peter Slaughterer,3,m,butcher,3250,evil,43765911445,214972673887395
8,Arthur Tailor,2,m,pilot,490,friendly,591266993653,214972673887395
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,214972673887395
10,Peter Drummer,1,m,smith,600,friendly,197435936456,214972673887395
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,214972673887395
13,Fred Dix,3,m,author,420,friendly,669762874033,214972673887395
14,Enrico Carpenter,3,m,weaponsmith,510,evil,307681368692,214972673887395
15,Helen Grasshead,2,f,dealer,560,friendly,611654306462,214972673887395
16,Ivy Hatter,1,f,dealer,770,evil,246604544829,214972673887395
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,214972673887395
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,214972673887395
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,214972673887395
20,Leslie Quals,1,?,?,190,?,228447687374,214972673887395

In [ ]:
%%sql
-- Action. Restore the pilot state.
UPDATE inhabitant SET state = 'kidnapped' WHERE job = 'pilot';

1 rows affected.

++
||
++
++

In [ ]:
%%sql
UPDATE inhabitant
SET state = 'emigrated'
WHERE personid = 20;

SELECT *
     , salt_051(sum(nn(hash)) OVER ()) AS token
FROM inhabitant;
--> Episode [053]

1 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,750,friendly,503254218482,215180942853051
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,215180942853051
3,Rita Ox,1,f,baker,350,friendly,550023509577,215180942853051
4,Carl Ox,1,m,merchant,250,friendly,828787612014,215180942853051
6,Gerry Slaughterer,2,m,butcher,4850,evil,723139316417,215180942853051
7,Peter Slaughterer,3,m,butcher,3250,evil,43765911445,215180942853051
8,Arthur Tailor,2,m,pilot,490,kidnapped,817131000772,215180942853051
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,215180942853051
10,Peter Drummer,1,m,smith,600,friendly,197435936456,215180942853051
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,215180942853051
13,Fred Dix,3,m,author,420,friendly,669762874033,215180942853051
14,Enrico Carpenter,3,m,weaponsmith,510,evil,307681368692,215180942853051
15,Helen Grasshead,2,f,dealer,560,friendly,611654306462,215180942853051
16,Ivy Hatter,1,f,dealer,770,evil,246604544829,215180942853051
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,215180942853051
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,215180942853051
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,215180942853051
20,Leslie Quals,1,?,?,190,emigrated,210861004791,215180942853051

In [ ]:
%%sql
UPDATE inhabitant
SET state = 'emigrated'
WHERE personid = 20;


UPDATE inhabitant
SET state = 'friendly'
WHERE job = 'pilot';


SELECT *
     , salt_051(sum(nn(hash)) OVER ()) AS token
FROM inhabitant;
--> Episode [049]

1 rows affected.

1 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,750,friendly,503254218482,214954541941196
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,214954541941196
3,Rita Ox,1,f,baker,350,friendly,550023509577,214954541941196
4,Carl Ox,1,m,merchant,250,friendly,828787612014,214954541941196
6,Gerry Slaughterer,2,m,butcher,4850,evil,723139316417,214954541941196
7,Peter Slaughterer,3,m,butcher,3250,evil,43765911445,214954541941196
8,Arthur Tailor,2,m,pilot,490,friendly,591266993653,214954541941196
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,214954541941196
10,Peter Drummer,1,m,smith,600,friendly,197435936456,214954541941196
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,214954541941196
13,Fred Dix,3,m,author,420,friendly,669762874033,214954541941196
14,Enrico Carpenter,3,m,weaponsmith,510,evil,307681368692,214954541941196
15,Helen Grasshead,2,f,dealer,560,friendly,611654306462,214954541941196
16,Ivy Hatter,1,f,dealer,770,evil,246604544829,214954541941196
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,214954541941196
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,214954541941196
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,214954541941196
20,Leslie Quals,1,?,?,190,emigrated,210861004791,214954541941196

**Episode [052].**

**Statement.** You have correctly updated the pilot's status. Now update yours to 'emigrated', and show the table `inhabitant`.

In [ ]:
%%sql
UPDATE inhabitant
SET state = 'emigrated'
WHERE personid = 20;

SELECT *
     , salt_052(sum(nn(hash)) OVER ()) AS token
FROM inhabitant;
--> Episode [049]

1 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,750,friendly,503254218482,256344827302981
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,256344827302981
3,Rita Ox,1,f,baker,350,friendly,550023509577,256344827302981
4,Carl Ox,1,m,merchant,250,friendly,828787612014,256344827302981
6,Gerry Slaughterer,2,m,butcher,4850,evil,723139316417,256344827302981
7,Peter Slaughterer,3,m,butcher,3250,evil,43765911445,256344827302981
8,Arthur Tailor,2,m,pilot,490,friendly,591266993653,256344827302981
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,256344827302981
10,Peter Drummer,1,m,smith,600,friendly,197435936456,256344827302981
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,256344827302981
13,Fred Dix,3,m,author,420,friendly,669762874033,256344827302981
14,Enrico Carpenter,3,m,weaponsmith,510,evil,307681368692,256344827302981
15,Helen Grasshead,2,f,dealer,560,friendly,611654306462,256344827302981
16,Ivy Hatter,1,f,dealer,770,evil,246604544829,256344827302981
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,256344827302981
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,256344827302981
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,256344827302981
20,Leslie Quals,1,?,?,190,emigrated,210861004791,256344827302981

**Episode [053].**

**Statement.** You have correctly updated your status. Now update the pilot's state to 'friendly', and show the table `inhabitant`.

In [ ]:
%%sql
UPDATE inhabitant
SET state = 'friendly'
WHERE job = 'pilot';

SELECT *
     , salt_053(sum(nn(hash)) OVER ()) AS token
FROM inhabitant;
--> Episode [049]

1 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,750,friendly,503254218482,147581890646645
2,Ernest Perry,3,m,weaponsmith,280,friendly,808409497125,147581890646645
3,Rita Ox,1,f,baker,350,friendly,550023509577,147581890646645
4,Carl Ox,1,m,merchant,250,friendly,828787612014,147581890646645
6,Gerry Slaughterer,2,m,butcher,4850,evil,723139316417,147581890646645
7,Peter Slaughterer,3,m,butcher,3250,evil,43765911445,147581890646645
8,Arthur Tailor,2,m,pilot,490,friendly,591266993653,147581890646645
9,Tiffany Drummer,1,f,baker,550,evil,343966752713,147581890646645
10,Peter Drummer,1,m,smith,600,friendly,197435936456,147581890646645
12,Otto Alexander,2,m,dealer,680,friendly,76959311691,147581890646645
13,Fred Dix,3,m,author,420,friendly,669762874033,147581890646645
14,Enrico Carpenter,3,m,weaponsmith,510,evil,307681368692,147581890646645
15,Helen Grasshead,2,f,dealer,560,friendly,611654306462,147581890646645
16,Ivy Hatter,1,f,dealer,770,evil,246604544829,147581890646645
17,Edward Grasshead,3,m,butcher,990,friendly,176983975453,147581890646645
18,Ryan Horse,3,m,blacksmith,390,friendly,179840833990,147581890646645
19,Ann Meaty,2,f,butcher,2280,friendly,76719042061,147581890646645
20,Leslie Quals,1,?,?,190,emigrated,210861004791,147581890646645

**Episode [049].** You have completed SQLab Island. What a big adventure!